export const mockMarkdownStr = `
# Markdown 流式文章示例
Markdown是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。Markdown编写的文档后缀为 \`.md\`。在这篇文章中，我将向您展示如何使用Markdown创建一篇包含标题、文本、图片和表格的文章。

## 文本
Markdown支持普通的文本格式，如粗体、斜体、删除线和下划线。您可以使用以下方式创建这些文本格式：
- **粗体**：使用两个 \`\*\` 或 \`_\` 包围文本，例如 \`\*\*粗体\*\*\` 或 \`__粗体__\`
- *斜体*：使用一个 \`\*\` 或 \`_\` 包围文本，例如 \`\*斜体\*\` 或 \`_斜体_\`
- ~~删除线~~：使用两个 \`~\` 包围文本，例如 \`~~删除线~~\`
- <u>下划线</u>：使用HTML标签 \`<u>\` 和 \`</u>\` 包围文本，例如 \`<u>下划线</u>\`

## 图片
在Markdown中，您可以使用以下语法插入图片：
\`\`\`
![图片描述](图片地址 "可选的标题")
\`\`\`
效果：
![这是一张小米SU7图片](https://img2.cheshi-img.com/center/680/30/9a/3b/f51c01801619ca221d1b6d81c6.jpeg)



## 表格
Markdown支持简单的表格创建。您可以使用以下语法创建表格：

| 标题1 | 标题2 | 标题3 |
|-------|-------|-------|
| 单元格1 | 单元格2 | 单元格3 |
| 单元格4 | 单元格5 | 单元格6 |

例如：
\`\`\`
| 姓名 | 年龄 | 性别 |
|------|------|------|
| 张三 | 25   | 男   |
| 李四 | 22   | 女   |
\`\`\`

## 结束语
以上是Markdown的基本用法，通过这些简单的标记，您可以创建一篇包含标题、文本、图片和表格的文章。Markdown的语法简单易懂，适合快速排版和分享文档。希望这篇文章对您有所帮助！
`;
